<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<div class="border-box">
	<article class="article-1">
		<h3>关于我：愿我爱的你们都能被时光温柔对待</h3>
		<p>我是晓夏，来自美丽的海滨城市——厦门。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/xiaoxia_1.jpg">
		<p>我足够幸运，有着顺遂的人生和爱我的父母，以及YY上爱我的粉丝。我也不够幸运，我做过平面模特，开过店铺，拍过广告，一度对人生很迷茫。幸好在经历短暂的波折后，我找到了方向。在时间的沉淀下，我的梦想也更加坚定。</p>
		<p>唱属于自己的歌曲给你们听——这个梦想很大，也很小。梦想需要你们的支持，也希望我的歌，能走进你们的内心，伴随我们一路前行。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/xiaoxia_2.jpg">

		<p>一直以来，演唱的都是别人的歌曲，现在我终于有机会唱出自己的声音。挫败让人坚强，别离令人珍惜，伤痛使人澄清。失去的曾经，亦不必太留念，只有从过去中站起，明天才会有希望。我们每一个人，终将不再是孤独夜空里的零零繁星，总会找到属于自己的美好。这首《孤零零》，便是我要与你们分享的心情故事。</p>
		<p>我常常想，一座城市令你念念不忘，大抵是因为，那里有你深爱的人和一去不复返的青春。美丽的山，温暖的城市，纵横的街道，不在身边的人。这个城市这段时光，我愿它定格成一幅温暖明朗的画，永远在我最美的梦里。一段情，某件事，能占据记忆的，皆是幸福。原来，一直陪着你的,是那个了不起的自己。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/xiaoxia_3.jpg">
		<p>感谢YY这个平台，让我能够表达出内心真实的写照，让我与你们有了这样一个特殊的沟通方式，与你们拉近了距离。</p>
		<p>当主播的这些年，都是被我可以放在壁橱的记忆，即使是经历无数次时间的洗涤，都是我无法割舍的珍宝。岁月静好，愿我爱的你们都能被时光温柔对待！</p>
	</article>
</div>