<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<div class="border-box">
	<article class="article-1">
		<h3>关于我：说唱就是把心里话告诉你们</h3>
		<p>我是浅蓝。今年20岁。</p>
		<p>从小我就不是一个老师和父母眼中的乖乖牌。不喜欢念书，就喜欢打篮球，听嘻哈，跳街舞。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/qianlan_1.jpg">
		
		<p>一次接触说唱是初中的时候。我们在跳街舞，一队说唱组合就在我们背后跟着曲子练说唱。一个朋友出国回来，推荐我听龙井组合的《归》，这是我第一首喜欢上的说唱。</p>
		<P>高中的时候，父母把我送去日本东京念书。日本打车特别贵，上学的那一段路，我喜欢走路，或者坐电车。如果走路的话，大概需要40分钟。这一路上，我会跟着伴奏瞎哼哼，边走边唱，看到什么唱什么。</P>
		<p>我觉得说唱这种形式非常吸引我。如果你分手了，流行歌的话会唱《分手快乐》，但说唱的话一定是更直接地表达自己想法。我觉得说唱不仅是节奏，更重要的是表达的正能量。最牛的说唱，不是单纯的有多好听，而是大家都能听懂，能融入歌里的世界。我希望自己的说唱能把心里的话让所有人都听懂。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/qianlan_2.jpg">
 
		<p>2014年3月份，我回到国内，正式在YY开播。每次直播，我随便拿一个伴奏，直播室里的粉丝想到什么，我唱什么。直播间从开始的几十个人，到现在一万五千人，算是上升很快的主播。但我一直都在提醒自己，记住以前是什么样的。</p>
		<img src="http://res1.idol.yystatic.com/images/articles/qianlan_3.jpg">
		<p>我自己也不断在学习写歌，想创作一首让所有人一听都知道是浅蓝的歌。我相信总有一天我能写出这样的歌。这一天会远吗？</p>
		<p>希望得到你的支持！</p>
	</article>
</div>