<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<section class="info-con">
		<p class="title">关于我：一个琴痴的古琴梦</p>
		<p>我是风小筝，一个古琴爱好者，师从虞山吴派第二代传人、现年九十二岁的古琴名家胡维礼老先生，现跟随著名的古琴演奏家乔珊老师学琴。</p>
		<p>古琴是我的至爱，每天早晨起来，我做的第一件事情就是抚琴，晚上临睡前的最后一件事情，还是抚琴。古琴能使人平心静气，放松身心，让生活减少烦恼，增添喜悦。有时忙里偷闲，只是拨弄几个悠然的散音，也能让心顿然安静下来。</p>
		<p>三年前，友人借给我一张她收藏的古琴，使我开始真正接触古琴，至今仍深深感恩，如果没有那张借来的古琴，当时我真的很难下决心花费数万元购琴学习，因为对于一名初学者而言，谁都无法确信自己是否可以坚持学好古琴。</p>
		<img src="http://img.dwstatic.com/1931/1501/284496699431/1420541512624.jpg">
		<p>古琴是我的至爱，每天早晨起来，我做的第一件事情就是抚琴，晚上临睡前的最后一件事情，还是抚琴。古琴能使人平心静气，放松身心，让生活减少烦恼，增添喜悦。有时忙里偷闲，只是拨弄几个悠然的散音，也能让心顿然安静下来。</p>


		<p class="title">关于我：一个琴痴的古琴梦</p>
		<p>我是风小筝，一个古琴爱好者，师从虞山吴派第二代传人、现年九十二岁的古琴名家胡维礼老先生，现跟随著名的古琴演奏家乔珊老师学琴。</p>
		<p>古琴是我的至爱，每天早晨起来，我做的第一件事情就是抚琴，晚上临睡前的最后一件事情，还是抚琴。古琴能使人平心静气，放松身心，让生活减少烦恼，增添喜悦。有时忙里偷闲，只是拨弄几个悠然的散音，也能让心顿然安静下来。</p>
		<p>三年前，友人借给我一张她收藏的古琴，使我开始真正接触古琴，至今仍深深感恩，如果没有那张借来的古琴，当时我真的很难下决心花费数万元购琴学习，因为对于一名初学者而言，谁都无法确信自己是否可以坚持学好古琴。</p>
		<img src="http://img.dwstatic.com/1931/1501/284496699431/1420541512624.jpg">
		<p>古琴是我的至爱，每天早晨起来，我做的第一件事情就是抚琴，晚上临睡前的最后一件事情，还是抚琴。古琴能使人平心静气，放松身心，让生活减少烦恼，增添喜悦。有时忙里偷闲，只是拨弄几个悠然的散音，也能让心顿然安静下来。</p>
</section>