<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<section class="info-con">
	<p class="title">关于我：永不服输的小水</p>
	<p>我是小水，是YY主播，也是一个简单的歌者，更是带给大家欢乐的使者。</p>
	<img src="http://res1.idol.yystatic.com/mobile/images/articles/xiaoshui_1.jpg">
	<p>17岁，我在沈阳音乐学院读书。一年后，得到去韩国发展的机会，在韩国SM公司进行培训。那时候，音乐是我的全部。但当我的即将从训练生出道时，因为父亲忽如其来的车祸，让我不得不放弃多年的音乐梦想，回国照顾父亲。在梦想和现实的打击下，渐渐变得的有些迷茫的我，认为也许换个行业，可能更适合我。于是我彻底脱离了音乐。</p>
	<p>转行后，我一直有所愧疚于一直支持我音乐事业的奶奶。奶奶的突然离世，让我明白，是时候结束这样麻木的生活了。</p>
	<img src="http://res1.idol.yystatic.com/mobile/images/articles/xiaoshui_2.jpg">

	<p>因缘际会，我成为了一名YY主播。我从小喜欢展现自我，当上主播后，我慢慢把生活中的一些行为展现给大家看时，也获得了大家的认可。当主播的这两年是我对音乐进行深刻领悟的过程，也是生活给我累积沉淀的过程。我不停学习，不断的思考，终于明白了自己音乐的初衷是什么，我想表达的是什么。</p>
	<p>我在音乐的道路上走来、离去、又绕回来。当失败一再对我拳打脚踢，当一切向我袭卷而来的时候，我擦干了眼角的泪，拍拍身上的尘土，告诉自己我不能认输。25岁，通过不懈的努力，找寻到属于自己的音乐道路。在YY这个平台，我赢得了鲜花和掌声。</p>
	<img src="http://res1.idol.yystatic.com/mobile/images/articles/xiaoshui_3.jpg">
	<p>从懵懂无知到相遇相知，你开始感恩于它，生怕有亏于它。YY这个平台，救赎了曾经迷茫、抑郁的我，能够将我的天性融合在我的音乐里面，得到自由生长。</p>
	<p>感谢这次的众筹，你们的支持是我最大的动力。音乐是一种分享，希望能与你们一起分享我永不认输的音乐历程。</p>
	<p>人生不止苟且，还有音乐和梦想，我会一直在路上！</p>
</section>
