
;//服务器-社区:错误码定义
var appResultDef = {
	"100000":"赠送个数为0", // [送道具]错误码	***********************************************
	"100001":"赠送个数过大，超过10000",
	"100002":"系统升级中，请稍后重试。（100002）",
	"100003":"支付服务不存在",// 在daemon中找不到 yypayif节点
	"100004":"udb服务不存在",//在daemon中找不到  udbif 节点
	
	"100005":"参数错误", // [多玩币支付]错误码 ***********************************************	
	"100006":"校验码错误",
	"100007":"时间错误",
	"100008":"订单已存在",
	"100009":"IP权限未开通",
	"100010":"用户禁止实时支付多玩币",
	"100011":"此项目无权限访问",
	"100012":"IP被封",
	"100013":"订单不存在",
	"100014":"佣金超过了用户在该产品的消费金额",
	"100015":"未知错误",
	
	"100016":"手机密码时候检查失败", //[手机绑定]错误码  ***********************************************
	"100017":"未收到udb回应",
	"100018":"处理失败",
	"100019":"访问太频繁",
	"100020":"验证码错误",
	"100021":"验证码过期",
	"100022":"Appid编号错误",
	"100023":"手机号码错误",
	"100024":"找不到对应手机号",
	
	"100025":"业务类型不存在", //[活动模板 Monitor]错误码  ***********************************************
	"100026":"错误的参数",
	"100027":"错误的 MAP 类型",
	"100028":"数据库操作错误",
	"100029":"未知错误",	
		
	"101001":"一般错误", //[微博]错误码  ***********************************************
	"101002":"昵称已被占用",
	"101003":"用户已经注册",
	"101004":"用户未注册",
	"101005":"对不起，您已达到关注人数上限（500人）。",
	"101006":"系统升级中，请稍后重试。（101006）",
	"101007":"缓存访问错误",
	"101008":"您已关注该用户，无需重复关注哦~",
	"101009":"并未关注对方",
	"101010":"系统升级中，请稍后重试。（101010）", // wbproxy超时
	"101011":"对不起，您不能关注自己，去看看其他人的微博吧~",
	"101012":"系统升级中，请稍后重试。（101012）",
	"101013":"对方尚未注册", 
	"101014":"请求参数有误", 
	"101015":"微博不存在", 
	"101016":"不允许多次修改性别", 

	"102000":"系统升级中，请稍后重试。（102000）", //[娱乐套件-座驾(车库)]错误码  ***********************************************
	"102001":"系统升级中，请稍后重试。（102001）",
	"102002":"啊哦！您来迟一步，这个号码已经被人抢先选走啦，请重新选择车牌号吧！",
	"102003":"普通车续费的时候需要弹窗", 
	"102004":"亲爱的用户，您已经有守护者专属车牌了，按F5刷新页面看看吧~", // 车牌类型错误(即已经拥有此类型的车牌)
	"102005":"亲爱的用户，您已经有男爵专属车牌了，按F5刷新页面看看吧~", // 车牌sub类型错误(即已经拥有此子类型的车牌)
	"102006":"车牌id错误",
	"102007":"车的类型错误",
	"102008":"普通车续费的时候，多玩币弹窗需要进行授权",
	"102009":"普通车续费的时候，红钻的弹窗确认窗口",
	"102010":"抱歉，您已经有这辆车啦，再看看其他车吧~",
	"102011":"座驾模块中，redis错误",
	"102012":"没有找到对应的车",
	"102013":"对不起，您只能续费 1 年哦~",
	"102014":"还没到车的续费开始时间",
	"102016":"对不起，你太长时间没操作，请换一批车牌号再选择",
	"102017":"该车牌不存在",
	"102024":"对不起，汽车总动员座驾为特殊车型，不能进行续费哦。",
	"102100":"一般错误",  //[娱乐套件-喊话]错误码  *********************************************** 
	"102101":"普通用户,无免费权限",
	"102102":"讲话太快",
	"102103":"不是签约频道",
	"102104":"需要确认支付",
	"102105":"悄悄话接受对象不是超级偶像",
	"102106":"悄悄话条数超出限制",
	"102107":"数据库错误",
	"102108":"无权限",

	"102201":"一般错误",  //[娱乐套件-超级偶像]错误码  *********************************************** 
	"102202":"对不起，您尚未达到申请条件。",
	"102203":"抱歉，读取信息错误，请联系YY客服。（102203）",
	"102204":"抱歉，该用户不是超级偶像，不能销售YY娱乐产品。请联系其他YY超级偶像进行购买。",
	"102205":"系统升级中，请稍后重新尝试。（102205）",
	
	"102301":"一般错误",  //[娱乐套件-娱乐名星]错误码  *********************************************** 
	"102302":"对不起，您尚未达到申请条件。",
	"102303":"抱歉，读取信息错误，请联系YY客服。（102203）",
	
	"102401":"一般错误",  //[娱乐套件-守护者]错误码  *********************************************** 
	"102402":"系统升级中，请稍后重新尝试。（102402）",
	"102403":"系统升级中，请稍后重新尝试。（102403）",
	"102404":"对不起，您已经是该超级偶像的守护者，请寻找其他超级偶像进行更换。",
	"102206":"对不起，您最长只能续费守护者到明年12月，请调整续费时长后重新续费。",

	"102601":"数据库处理失败",  //[娱乐套件-贵族]错误码  *********************************************** 
	"102602":"数据不存在",
	"102603":"数据不存在",
	"102604":"缓存数据不存在",
	"102605":"缓存数据不存在",
	"102606":"数据错误 ",
	"102608":"插入数据错误",
	"102609":"数据错误",
	"102610":"数据错误",
	"102611":"超出最长期限",
	"102613":"活动用户不能续费",
	
	"103001":"一般错误",  //[娱乐套件-扣费]错误码  *********************************************** 
	"103002":"抱歉，您的余额不足，请充值后再来吧！",
	"103003":"数据库异常",
	"103004":"SQL语句错误",
	"103005":"REDIS缓存异常",
	"103006":"缺少超级偶像的信息",
	"103007":"未知的货币",
	"103008":"不支持这种货币的消费",
	"103009":"不支持同时消费多种货币",
	"103010":"不允许不消费任何货币",
	"103011":"不允许消费货币数为0",
	"103012":"非法汇率",
	"103013":"缺汇率信息",
	"103014":"数据库事务处理失败",
	"103017":"对不起，娱乐套件V4.0删档内测期间，只有受邀用户才能使用该功能哦。",
	//"103200":"多玩币系统异常基数", //未用
	
	"103190":"参数错误", // 多玩币系统返回码,转换后用于社区
	"103189":"校验码错误",
	"103185":"时间错误",
	"103182":"订单已存在",
	"103179":"IP权限未开通",
	"103170":"用户未授权，需弹出对话框",
	"103169":"用户禁止实时支付多玩币",
	"103168":"抱歉，您的Y币余额不足，请充值后再来吧！",
	"103200":"抱歉，您的支付请求超时！",
	"103019":"查历史记录超出有效范围",
	"103119":"用户手机近期内有修改，3天内佣金不能用于消费",//YB系统返回：用户更换手机的情况的错误码，3天不能进行消费

	"104001":"一般错误",  //[娱乐套件-视频]错误码  *********************************************** 
	"104002":"SQL语句错误",
	"104003":"REDIS异常",
	"104004":"不在直播状态",
	"104005":"正在直播状态",
	"104006":"不是指定频道的主播",

	"105001":"错误的货品大类",  //[娱乐套件-商城]错误码  *********************************************** 
	"105002":"错误的货品ID",
	"105003":"对不起，您已提交该订单，请勿重复提交！", // 每次只能购买一个商品，也就是说不支持一个订单买2个以上
	"105004":"系统升级中，请稍后重试。（105004）",
	"105005":"抱歉，这辆车您已经买过啦，不妨再看看还有没有其他喜欢的车呢~", // 用户购买同一个车多次
	"105006":"错误的产品排序规则",
	"105007":"系统升级中，请稍后重试。（105007）",
	"105008":"对不起，商品已经过期！（105008）",
	
	"106007":"对不起，您的签约频道错误！（106007）",
	"106016":"您点击的人不是主播，不能订阅（106016）",
	"100":"邀请已存在，请到历史通知处理(100)",
	"101":"邀请不存在(101)",
	"102":"邀请状态不为开始，不能再进行别的操作(102)",
	"103":"当前还有未结束的合约(103)",
	"104":"存在为结束的合约(104)",
	"105":"没有找到指定的合约(105)",
	"106":"查询结束(106)",
	"107":"系统拒绝解约(107)",
	
	// Y币返回码
//	"103200" : "超时",
//	"103190" : "参数错误",
//	"103189" : "校验码错误",
//	"103185" : "时间错误",
//	"103182" : "订单已存在",
	"103181" : "冻结订单已解冻并扣款",
	"103180" : "冻结订单已解冻并退款",
//	"103179" : "IP权限未开通",
	"103178" : "用户不存在/订单不存在",
//	"103170" : "用户未授权，需弹出对话框",
//	"103169" : "用户选择“不同意”",
//	"103168" : "余额不足",
	"103167" : "此项目无权限访问",
	"103166" : "IP被封",
	"103165" : "订单不存在",
	"103164" : "佣金超过了用户在该产品的消费金额",
	"103163" : "此产品未绑定产品账户",
	"103160" : "非法的URL",
	"103159" : "URL已被使用",
	"103157" : "订单状态异常",
	"103150" : "冻结资金订单不合法",
	"103140" : "企业用户不能使用扣费接口",
	"103130" : "扣费系统服务停止",
	"103120" : "风控异常",
//	"103119" : "用户手机近期内有修改，3天内佣金不能用于消费",
	"103118" : "您的Y币支付功能已经被冻结，请用手机发送指令'JDYB YY号'解冻",
	"103100" : "未知错误",
	
	"107001":"对不起，主播当前在解约状态，无法开通或续费珍爱特权。", //[娱乐-珍爱特权]错误码  *********************************************** 
	"107002":"对不起，主播不能给自己开通珍爱特权。",
	"107003":"对不起，不能更换为较低等级的珍爱特权。",
	
	"-1":"小Y暂时无法与服务器取得连接，请大家稍候哦~   （错误码：-1）",
	"-2":"小Y暂时无法与服务器取得连接，请大家稍候哦~   （错误码：-2）",
	"-3":"小Y暂时无法与服务器取得连接，请大家稍候哦~   （错误码：-3）",
	"-4":"小Y暂时无法与服务器取得连接，请大家稍候哦~   （错误码：-4）",
	"110":"用户本月已发生违规，不能解约",
    "16" : "机构收取金额不能大于总金额",
	"0":"处理成功" //处理成功
};

//服务错误定义
var serverErrorDef = {
	"-1":"服务器连接不上",
	"-2":"数据读写异常",
	"-3":"数据读取超时",
	"-4":"服务器异常"
};

//返回错误码描述
function getResultDesc(errorCode){
	var result_ch = appResultDef[errorCode];
	if(!result_ch){
		result_ch =  "未知错误，错误码:["+errorCode+"]";
	}
	return result_ch;
}

//处理失败
function payFailedResult(result){
	if(result == 103002 || result ==103168){ // 余额不足
		resultDesc = getResultDesc(result);
		top.$.messagebox({type:'pay', msg:resultDesc,buttons: [{text:'充值',iconCls:'ico-btn-order-ok'}],fn:function(button, msg){
			if(button.index == 0){
				window.open('https://pay.duowan.com/userDepositDWAction.action');
			}
		}});
		return;
	}
	else if(result == 103017 ){ // 娱乐套件V4.0删档内测提示(不支持Y币支付)
		resultDesc = getResultDesc(result);
		top.$.messagebox({type:'pay', msg:resultDesc, buttons: [{text:'关 闭',iconCls:'ico-btn-order-ok'}]
			,width:400,fn:function(button, msg){
			if(button.index == 0){	
				
			}
		}});
		return;
	}
	else{ //其它
		resultDesc = getResultDesc(result);
		top.$.messagebox({type:'error', msg:resultDesc});
		return;
	}
}
;